**** Example
Monadic use:
#+begin_src j :session
]t=.3 4 $ i.12
; t
#+end_src

#+RESULTS:
: 0 1  2  3
: 4 5  6  7
: 8 9 10 11
: 
: 0 1 2 3 4 5 6 7 8 9 10 11

Dyadic use:
#+begin_src j :session
1 ; 3 ; 10
#+end_src

#+RESULTS:
: ┌─┬─┬──┐
: │1│3│10│
: └─┴─┴──┘

**** Example
Monadic use:
#+begin_src j :session
}: 1 2 3 4
#+end_src

#+RESULTS:
: 1 2 3

**** Example
Monadic use:
#+begin_src j :session
?. 8
#+end_src

#+RESULTS:
: 2

Dyadic use:
#+begin_src j :session
2 ?. 8
#+end_src

#+RESULTS:
: 2 4

**** Example
Dyadic use:
#+begin_src j :session
< b=: 1 2 3 ; 2 3 5 7 ; 'abcde'
#+end_src

#+RESULTS:
: ┌─────────────────────┐
: │┌─────┬───────┬─────┐│
: ││1 2 3│2 3 5 7│abcde││
: │└─────┴───────┴─────┘│
: └─────────────────────┘
continued...
#+begin_src j :session
(<|. &.> b) NB.  Reversal under open
#+end_src

#+RESULTS:
: ┌─────────────────────┐
: │┌─────┬───────┬─────┐│
: ││3 2 1│7 5 3 2│edcba││
: │└─────┴───────┴─────┘│
: └─────────────────────┘
